# Terraform environment yt01
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
module.postgres_server.data.azurerm_client_config.current: Reading...
data.azurerm_user_assigned_identity.admin: Reading...
data.azurerm_subnet.postgres: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001yt01/subnets/Postgres]
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001yt01]
data.azurerm_private_dns_zone.postgres: Reading...
data.azurerm_private_dns_zone.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.register has been deleted
  - resource "azurerm_resource_group" "register" {
        id       = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgregisteraltinnauth001yt01"
      - name     = "rgregisteraltinnauth001yt01" -> null
        tags     = {}
        # (1 unchanged attribute hidden)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server has been deleted
  - resource "azurerm_postgresql_flexible_server" "postgres_server" {
      - id                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgregisteraltinnauth001yt01/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvregisteraltinnauth001yt01" -> null
      - name                          = "psqlsrvregisteraltinnauth001yt01" -> null
        tags                          = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_management_lock.delete["psqlsrvregisteraltinnauth001yt01"] will be created
  + resource "azurerm_management_lock" "delete" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "Terraform"
      + notes      = "Terraform Managed Lock"
      + scope      = (known after apply)
    }

  # azurerm_resource_group.register will be created
  + resource "azurerm_resource_group" "register" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "rgregisteraltinnauth001yt01"
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be created
  + resource "azurerm_postgresql_flexible_server" "postgres_server" {
      + administrator_login           = (known after apply)
      + auto_grow_enabled             = true
      + backup_retention_days         = 14
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001yt01/subnets/Postgres"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "psqlsrvregisteraltinnauth001yt01"
      + private_dns_zone_id           = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "rgregisteraltinnauth001yt01"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = "P4"
      + version                       = "16"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = false
          + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
        }
    }

  # module.postgres_server.azurerm_postgresql_flexible_server_active_directory_administrator.admin["8b603bc9-36c7-4074-bb73-a363e0c5696b"] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + object_id           = "8b603bc9-36c7-4074-bb73-a363e0c5696b"
      + principal_name      = "mipgsqladminaltinnauth001yt01"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "rgregisteraltinnauth001yt01"
      + server_name         = "psqlsrvregisteraltinnauth001yt01"
      + tenant_id           = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/altinn-register` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/yt01/register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_yt01_register.tfstate.tfplan`